Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
pip install pandas

Requirement already satisfied: pandas in /opt/conda/lib/python3.10/site-packages (1.5.2)
Requirement already satisfied: python-dateutil>=2.8.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2022.6)
Requirement already satisfied: numpy>=1.21.0 in /opt/conda/lib/python3.10/site-packages (from pandas) (1.23.5)
Requirement already satisfied: six>=1.5 in /opt/conda/lib/python3.10/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [5]:
#importing pandas
import pandas as pd
# create a list with a data series
Data = pd.Series([4,8,15,16,23,42])
print(Data)
type(Data)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

pandas.core.series.Series

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [7]:
# creating a list with 10 elements
ele = [1,2,3,45,6,7,8,9,1,34]
#list convert to panda series
data1 = pd.Series(ele)
print(data1)
type(data1)

0     1
1     2
2     3
3    45
4     6
5     7
6     8
7     9
8     1
9    34
dtype: int64

pandas.core.series.Series

Q3. Create a Pandas DataFrame that contains the following data:

In [11]:
#creating a dataframe
df = pd.DataFrame({'Name': ['Alice','Bob','Claire'],
                   'Age':  [25,30,27],
                   'Gender':['female','Male','female']})
print(df)
df

     Name  Age  Gender
0   Alice   25  female
1     Bob   30    Male
2  Claire   27  female

     Name  Age  Gender
0   Alice   25  female
1     Bob   30    Male
2  Claire   27  female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

Dataframe = A DataFrame is a two-dimensional labeled data structure with columns of potentially different types. It is a collection of series that share the same index. Each column of data is represented as a pandas Series.

In [12]:
#example dataframe
data = pd.DataFrame({'Name': ['shahnawaz','matin','kulsum'],
                        'Age':[20,20,20],
                        'Gender':['Male','Male','Female']})

series = A Series is a one-dimensional array holding data of any type. It is also the data structure for a single column of a DataFrame.

In [14]:
#example series
data1 = pd.Series([1,2,3,4,5,'shahnawaz','sk'])

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

In [15]:
import pandas as pd

# Create a DataFrame
df = pd.DataFrame({'A': [1, 2, 3, 4, 5], 'B': ['a', 'b', 'c', 'd', 'e']})

# View the first three rows
print(df.head(3))

# View the last two rows
print(df.tail(2))

   A  B
0  1  a
1  2  b
2  3  c
   A  B
3  4  d
4  5  e

In [17]:
#These functions allow you to view the first few rows (head()) or last few rows (tail()) of a DataFrame. 
df.head()

   A  B
0  1  a
1  2  b
2  3  c
3  4  d
4  5  e

In [18]:
df.tail()

   A  B
0  1  a
1  2  b
2  3  c
3  4  d
4  5  e

In [20]:
df.sort_values('B')

   A  B
0  1  a
1  2  b
2  3  c
3  4  d
4  5  e

In [21]:
df.sort_values('B',ascending = False)

   A  B
4  5  e
3  4  d
2  3  c
1  2  b
0  1  a

In [22]:
df.describe()

              A
count  5.000000
mean   3.000000
std    1.581139
min    1.000000
25%    2.000000
50%    3.000000
75%    4.000000
max    5.000000

In [25]:
df.groupby('B').sum()

   A
B
a  1
b  2
c  3
d  4
e  5

In [27]:
df.dtypes

A     int64
B    object
dtype: object

In [29]:
df.drop('A',axis =1)

   B
0  a
1  b
2  c
3  d
4  e

In [31]:
df1 = pd.DataFrame({'A': ['a','b',1,2],
                    'C':[1,2,3,4]})

In [33]:
merge_pd = pd.merge(df,df1)
merge_pd

   A  B  C
0  1  a  3
1  2  b  4

In [34]:
pd.merge(df,df1,how = 'left')

   A  B    C
0  1  a  3.0
1  2  b  4.0
2  3  c  NaN
3  4  d  NaN
4  5  e  NaN

In [35]:
pd.merge(df,df1,how = 'right')

/tmp/ipykernel_104/2053121177.py:1: FutureWarning: In a future version, the Index constructor will not infer numeric dtypes when passed object-dtype sequences (matching Series behavior)
  pd.merge(df,df1,how = 'right')

     A    B  C
0    a  NaN  1
1    b  NaN  2
2  1.0    a  3
3  2.0    b  4

In [36]:
pd.merge(df,df1,how = 'outer')

/tmp/ipykernel_104/3374315633.py:1: FutureWarning: In a future version, the Index constructor will not infer numeric dtypes when passed object-dtype sequences (matching Series behavior)
  pd.merge(df,df1,how = 'outer')

     A    B    C
0  1.0    a  3.0
1  2.0    b  4.0
2  3.0    c  NaN
3  4.0    d  NaN
4  5.0    e  NaN
5    a  NaN  1.0
6    b  NaN  2.0

In [41]:
pd.concat([df,df1])

   A    B    C
0  1    a  NaN
1  2    b  NaN
2  3    c  NaN
3  4    d  NaN
4  5    e  NaN
0  a  NaN  1.0
1  b  NaN  2.0
2  1  NaN  3.0
3  2  NaN  4.0

In [43]:
pd.concat([df,df1],axis = 1)

   A  B    A    C
0  1  a    a  1.0
1  2  b    b  2.0
2  3  c    1  3.0
3  4  d    2  4.0
4  5  e  NaN  NaN

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

In [45]:
#creating using multiple series\n",
s =pd.Series([1,2,3,4,5,6,7])
s1=pd.Series(['shahnawaz','matin','kulsum'])

Q7. Create a DataFrame using multiple Series. Explain with an example.